Autodesk.Revit.DB.Structure.MultiplanarOption
Input argument type for Rebar.GetCenterlineCurves method.
Controls whether all curves of a multi-planar Rebar element are returned by
GetCenterlineCurves, or only the curves in the primary plane.

Autodesk.Revit.DB.Structure.MultiplanarOption.IncludeOnlyPlanarCurves
Include only curves which lie in the Rebar's primary plane.

Autodesk.Revit.DB.Structure.MultiplanarOption.IncludeAllMultiplanarCurves
Include all curves.